storage/tests/bfbf20d0-8f28-4fbe-92f4-46b5430faf9c/k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /home/user/Desktop/simple load testing/backend/storage/tests/bfbf20d0-8f28-4fbe-92f4-46b5430faf9c/script.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 40s max duration (incl. graceful stop):
              * default: 5 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 5 VUs  01.0s/10s

running (02.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [  20% ] 5 VUs  02.0s/10s

running (03.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [  30% ] 5 VUs  03.0s/10s

running (04.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [  40% ] 5 VUs  04.0s/10s

running (05.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [  50% ] 5 VUs  05.0s/10s

running (06.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [  60% ] 5 VUs  06.0s/10s

running (07.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [  70% ] 5 VUs  07.0s/10s

running (08.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [  80% ] 5 VUs  08.0s/10s

running (09.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [  90% ] 5 VUs  09.0s/10s

running (10.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [ 100% ] 5 VUs  10.0s/10s

running (11.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  10s

running (12.0s), 4/5 VUs, 1 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  10s

running (13.0s), 3/5 VUs, 2 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  10s

running (14.0s), 2/5 VUs, 3 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  10s

running (15.0s), 2/5 VUs, 3 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  10s

running (16.0s), 2/5 VUs, 3 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  10s

running (17.0s), 1/5 VUs, 4 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  10s


  █ TOTAL RESULTS 

    checks_total.......: 30     1.76134/s
    checks_succeeded...: 83.33% 25 out of 30
    checks_failed......: 16.66% 5 out of 30

    ✗ status ok
      ↳  83% — ✓ 25 / ✗ 5

    HTTP
    http_req_duration..............: avg=138.18ms min=4.49ms med=10.16ms max=700.61ms p(90)=413.39ms p(95)=432.51ms
      { expected_response:true }...: avg=72.29ms  min=4.49ms med=9.05ms  max=412.49ms p(90)=293.42ms p(95)=355.06ms
    http_req_failed................: 16.66% 5 out of 30
    http_reqs......................: 30     1.76134/s

    EXECUTION
    iteration_duration.............: avg=14.33s   min=11.88s med=13.41s  max=17.03s   p(90)=16.81s   p(95)=16.92s  
    iterations.....................: 5      0.293557/s
    vus............................: 1      min=1       max=5
    vus_max........................: 5      min=5       max=5

    NETWORK
    data_received..................: 13 kB  743 B/s
    data_sent......................: 9.1 kB 536 B/s



running (17.0s), 0/5 VUs, 5 complete and 0 interrupted iterations
default ✓ [ 100% ] 5 VUs  10s